Revit 2027 API
BendingDetailDisplayMode Enumeration
 Describes the mode in which the Bending Detail will be represented.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum BendingDetailDisplayMode
Public Enumeration BendingDetailDisplayMode
public enum class BendingDetailDisplayMode
type BendingDetailDisplayMode
Members
Member name | Value | Description
Realistic | 0 |  The bending detail is represented based on the rebar's geometry.
Schematic | 1 |  The bending detail is represented in a schematic way based on the rebar shape's geometry.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace